KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтражениеФактическогоРасходаСырья/КАНАТ_ОтражениеФактическогоРасходаСырья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КАНАТ_ОтражениеФактическогоРасходаСырья</name>
</mdclass:DataProcessor>

KanatERPSukhova.КанатАдаптация/src/Documents/ЭтапПроизводства2_2/ЭтапПроизводства2_2.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="03503ac6-a4b9-4d70-b0ef-949dac7b8de4">
  <name>ЭтапПроизводства2_2</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.КАНАТ_СоответствиеГрупповыхУпаковокСериямНоменклатуры</registerRecords>
  <attributes>
    <name>КАНАТ_КомментарийКЗаказу</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Сертификат</name>
    <type>
      <types>CatalogRef.КАНАТ_Сертификаты</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="49fb8c7a-a984-433d-9013-98b3f1808eba">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0662487e-07e7-4fe3-b008-ffb293a9f154">
    <name>Спецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="38ea66f4-5bfa-48f1-8431-a99d27fcf31d">
    <name>ДатаПроизводства</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="dc035f49-1f37-4bf6-a369-751f132442a2">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КАНАТ_КомментарийКЗаказу</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КАНАТ_Сертификат</name>
      <type>
        <types>CatalogRef.КАНАТ_Сертификаты</types>
      </type>
    </attributes>
    <attributes extendedConfigurationObject="20aa6e93-6a18-4526-830f-8d45d3e04bb6">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="5d7b896b-c4b4-4604-9f9b-3b0fcf1196e3">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="42da4e01-6f2b-447f-a8ce-82c02d461afd">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="691cd7ff-4cd5-4d21-a6a6-32338ca8eb43">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="3a4b1c3c-2a58-45b8-bea3-df1e63deaecc">
    <name>РасходМатериаловИРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="f770e39d-256e-4caa-a806-c8d8fbdc962b">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="4bfa3470-ec68-4384-ab44-61dc34f81542">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c2a5e8ce-e0dd-4c5e-bacb-a38121ee5440">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ca22f78a-e6c7-4d0a-abdf-dafcd0e7e8ca">
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

KanatERPSukhova.КанатАдаптация/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee5a63d2-90be-4f36-8a88-5415230abebc">
  <name>РесурсныеСпецификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="436cac62-4694-43a2-8d22-669228b1baf1">
    <name>ОсновноеИзделиеКоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc79d025-e4b3-4adf-ad53-eda1f76f3bfa">
    <name>ОсновноеИзделиеНоменклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50617dd7-6ff4-4dc2-a0d1-1996bd1af55b">
    <name>ОсновноеИзделиеХарактеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТехнологическаяСпецификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ДокладнаяЗаписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Основание</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="dea18009-f98d-468a-859b-cf3cce9196a0">
    <name>СпособРаспределенияЗатратНаВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f541bc89-351d-4def-99c7-bc02b9497244">
    <name>ВариантНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ef8d7a41-0646-43ad-88f6-4a05fdfd4001">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7c508eb-b4e9-4a54-9256-56fe64f44bf1">
    <name>НачалоДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c0db759b-cb86-470f-ac1a-4622007748c9">
    <name>КонецДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fccdf260-9852-4290-a022-4a8aa7f7f0f4">
    <name>ВыпускПроизвольнымиПорциями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="052b8eae-f60e-4c3c-abd6-a4695a5e825e">
    <name>МинимальнаяПартияВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b7f922c-a145-4699-8371-53c4af687ca8">
    <name>МногоэтапныйПроизводственныйПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3abe02c-7357-44f4-8c29-1103001fc9a0">
    <name>ЕстьНекратныеНормативыВРЦ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="274549a5-518a-4913-a049-05b30732d5ba">
    <name>ТипПроизводственногоПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5bbc3dbe-eeea-4b75-9545-caf94f8f036f">
    <name>РазрешитьВыборДляИзделийПобочногоВыхода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1c367fe-c52b-4c0f-a74f-6845403cc761">
    <name>ОптимальнаяПартияВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="add9bf8f-b6e4-499c-97f2-421c3d17eb91">
    <name>ОграниченСрокПролеживанияВыходныхИзделий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="406ad767-ca83-4ad0-b1f8-9ac8daee6f79">
    <name>МаксимальныйСрокПролеживанияВыходныхИзделий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="606417f4-2092-4500-a40a-6e49ae00544d">
    <name>ОптимальноеКоличествоПередачиМеждуЭтапами</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f7f6ae2-e8b9-4fce-8fa3-629ee39f2ca5">
    <name>ПечатьМаршрутнойКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f664e98-6ce5-44b6-b35a-8e83c01a9b69">
    <name>ОсновноеИзделиеВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c90f934b-9c20-478f-85ee-7274cd9979b8">
    <name>ОписаниеУточненияПрименения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fc2e8a86-949a-4e4f-812b-94f43e3fd12e">
    <name>ОсновноеИзделиеУпаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f3124293-0b8d-4882-b23c-439b2566fc63">
    <name>ОсновноеИзделиеЭтап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8cfece92-bb5d-4623-871a-42563d78d9c0">
    <name>ЕстьВложенныеСпецификации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5c232012-137e-4fe3-a365-c69eecfc553a">
    <name>ДопустимоеПревышениеОптимальнойПартииВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d9e9276-13e9-4b17-a242-69b99618df3c">
    <name>ВариантПодбораВДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0634919c-9496-4ed5-8d44-222275fdf51d">
    <name>ЕстьУточняемоеОсновноеИзделие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="71f3c8a4-5f20-400f-aef5-acbf7a734855">
    <name>ЕстьПараметризацияРесурсов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02138102-fb2c-4d61-a0ee-ad75034be9fa">
    <name>ЕстьРасчетВероятности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c225c8c7-cc0e-4917-91b9-de521887536d">
    <name>ОтветственноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0ad745f-112b-4b3c-8d90-d1200757685d">
    <name>ИдентификаторВерсииДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f3f60468-b96f-4528-8adc-5b0b567a3e3d">
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3112143-6304-49ed-abcf-b14fe2425c34">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d938bbe4-fc79-49eb-ba11-f6f1d62d7ab4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c760a5ad-a536-49ec-816d-fad0d87140f3">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2a6c2c71-230f-425a-a0e6-d556c2f47f3a">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dee0ba41-dd89-4212-ace9-8a7a209bce5b">
      <name>АлгоритмАвтовыбораХарактеристики</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b1e20410-a0e0-4aba-8122-7aef753d2cd5">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="71a20cef-31cc-4da2-82e6-195ae04b99d6">
      <name>ТребуетсяУказыватьСерии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9766914-b51b-49c3-854b-6185efea75fc">
      <name>ОписаниеИзделия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e00a89f7-24ad-4d28-8e86-331ef04bb0d7">
    <name>ВозвратныеОтходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="76aa45fe-dde7-48b0-940f-7eaf21bba0cc">
    <name>Трудозатраты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/DataProcessors/КАНАТ_ОтражениеФактическогоРасходаСырья/Forms/Форма/Module.bsl
&НаСервере
Процедура ЗаполнитьТекущимиДаннымиНаСервере()
	ФактическийРасход.Очистить();
	
	Запрос = Новый Запрос;   
	#Область ПервыйВариантРеализации
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Материал,
	//|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК СсылкаРесурснаяСпецификация,
	//|	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок/РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеКоличествоУпаковок) КАК НормаНаШт
	//|ПОМЕСТИТЬ ВТИнфоПоНорме
	//|ИЗ
	//|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	//|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Статус КАК Статус,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка КАК Этап,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура КАК Изделие,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.Артикул КАК КодИзделия,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ПартияПроизводства.ОсновноеИзделиеХарактеристика КАК ХарактеристикаИзделия,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияИзделия,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.КоличествоУпаковокФакт КАК КоличествоИзделия,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура КАК Сырье,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Характеристика КАК ХарактеристикаСырья,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура.Артикул КАК КодСырья, 
	//|	Максимум(НЕ ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура.ГруппаФинансовогоУчета.КАНАТ_ГруппаФинансовогоУчетаВспомогательногоСырья) КАК ОсновноеСырье, 
	//|	МАКСИМУМ(ЭтапПроизводства2_2ВыходныеИзделия.Количество * ВТИнфоПоНорме.НормаНаШт) КАК НормаРасхода, 
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.КоличествоУпаковок КАК ФактРасхода,
	////|	ЭтапПроизводства2_2РасходМатериаловИРабот.КоличествоУпаковок КАК КоличествоУпаковокРасход,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация КАК Спецификация,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ДатаПроизводства КАК ДатаПроизводства,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.КАНАТ_КомментарийКЗаказу КАК КомментарийКЗаказу,
	////|	ЭтапПроизводства2_2РасходМатериаловИРабот.ИдентификаторСтроки КАК ИдентификаторСтроки,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.ДатаРасхода КАК ДатаРасхода,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.СтатьяКалькуляции КАК СтатьяКалькуляции,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.НомерСтроки КАК РасходНомерСтроки                    
	//|ИЗ
	//|	ВТИнфоПоНорме КАК ВТИнфоПоНорме
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	//|		ПО ВТИнфоПоНорме.СсылкаРесурснаяСпецификация = ЭтапПроизводства2_2ВыходныеИзделия.Ссылка.Спецификация
	//|			И ВТИнфоПоНорме.СсылкаРесурснаяСпецификация.ОсновноеИзделиеНоменклатура = ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура
	////|			И ВТИнфоПоНорме.СсылкаРесурснаяСпецификация.ОсновноеИзделиеХарактеристика = ЭтапПроизводства2_2ВыходныеИзделия.Характеристика
	//|		ПРАВОЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2.РасходМатериаловИРабот КАК ЭтапПроизводства2_2РасходМатериаловИРабот
	//|		ПО (ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация = ВТИнфоПоНорме.СсылкаРесурснаяСпецификация)
	//|			И (ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура = ВТИнфоПоНорме.Материал)
	//|ГДЕ
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ДатаПроизводства >= &ДатаНачала
	//|	И ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ДатаПроизводства <= &ДатаОкончания
	//|	
	//|СГРУППИРОВАТЬ ПО
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.ДатаРасхода,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.СтатьяКалькуляции,
	////|	ЭтапПроизводства2_2РасходМатериаловИРабот.ИдентификаторСтроки,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Характеристика,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.НомерСтроки,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.КАНАТ_КомментарийКЗаказу,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.ДатаПроизводства,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.КоличествоУпаковок,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Номенклатура.Артикул,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.КоличествоУпаковокФакт,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация.ОсновноеИзделиеУпаковка,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация.ОсновноеИзделиеХарактеристика,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация.ОсновноеИзделиеНоменклатура.Артикул,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Спецификация.ОсновноеИзделиеНоменклатура,
	//|	ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Статус
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Этап,
	//|	Изделие,
	//|	РасходНомерСтроки";
	//	
	//СхемаЗапроса = Новый СхемаЗапроса;
	//СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);  
	//
	//Если ЗначениеЗаполнено(Подразделение) тогда
	//	СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Подразделение = &Подразделение)");
	//	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	//КонецЕсли;
	//Если ЗначениеЗаполнено(СтатусЭтапа) тогда
	//	СхемаЗапроса.ПакетЗапросов[1].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2РасходМатериаловИРабот.Ссылка.Статус В(&Статусы))");
	//	Запрос.УстановитьПараметр("Статусы", СтатусЭтапа);
	//КонецЕсли;
	//Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	//      
	#КонецОбласти
	Запрос.Текст =      //Игнорируем упаковки т.к. не планируется использовать типовой функционал упаковок
	"ВЫБРАТЬ
	|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Материал,
	|	РесурсныеСпецификацииМатериалыИУслуги.Характеристика КАК Характеристика,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка КАК СсылкаРесурснаяСпецификация,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура КАК ОсновноеИзделиеНоменклатура,
	|	СУММА(РесурсныеСпецификацииМатериалыИУслуги.КоличествоУпаковок / Выбор когда РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеКоличествоУпаковок > 0 ТОгда РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеКоличествоУпаковок Иначе 1 Конец) КАК НормаНаШт
	|ПОМЕСТИТЬ ВТИнфоПоНорме
	|ИЗ
	|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
	|
	|СГРУППИРОВАТЬ ПО
	|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура,
	|	РесурсныеСпецификацииМатериалыИУслуги.Характеристика,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка,
	|	РесурсныеСпецификацииМатериалыИУслуги.Ссылка.ОсновноеИзделиеНоменклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура КАК НоменклатураИзделие,
	|	ЭтапПроизводства2_2ВыходныеИзделия.КоличествоУпаковок КАК КоличествоУпаковокИзделие,
	|	ЭтапПроизводства2_2.Ссылка КАК ЭтапПроизводства2_2Ссылка
	|ПОМЕСТИТЬ ВТКоличествоИзделия
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ВыходныеИзделия КАК ЭтапПроизводства2_2ВыходныеИзделия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭтапПроизводства2_2 КАК ЭтапПроизводства2_2
	|		ПО (ЭтапПроизводства2_2ВыходныеИзделия.Ссылка = ЭтапПроизводства2_2.Ссылка
	|				И ЭтапПроизводства2_2ВыходныеИзделия.Номенклатура = ЭтапПроизводства2_2.ПартияПроизводства.ОсновноеИзделиеНоменклатура)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Статус КАК Статус,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка КАК Этап,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства КАК ДатаРасхода,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура КАК Изделие,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.Артикул КАК КодИзделия,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеХарактеристика КАК ХарактеристикаИзделия,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмеренияИзделия,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КоличествоУпаковокФакт КАК КоличествоИзделия,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура КАК Сырье,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика КАК ХарактеристикаСырья,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.Артикул КАК КодСырья, 
	|	МАКСИМУМ(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено) КАК Отменено,
	|	МАКСИМУМ(НЕ ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.ГруппаФинансовогоУчета.КАНАТ_ГруппаФинансовогоУчетаВспомогательногоСырья) КАК ОсновноеСырье,
	|	СУММА(ВТКоличествоИзделия.КоличествоУпаковокИзделие * ВТИнфоПоНорме.НормаНаШт) КАК НормаРасхода,
	|	МАКСИМУМ(Выбор когда ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Отменено Тогда 0 Иначе ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок конец) КАК ФактРасхода,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация КАК Спецификация,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства КАК ДатаПроизводства,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КАНАТ_КомментарийКЗаказу КАК КомментарийКЗаказу,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки КАК ОбеспечениеНомерСтроки
	|ИЗ
	|	Документ.ЭтапПроизводства2_2.ОбеспечениеМатериаламиИРаботами КАК ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнфоПоНорме КАК ВТИнфоПоНорме
	|		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация = ВТИнфоПоНорме.СсылкаРесурснаяСпецификация)
	|			И (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура = ВТИнфоПоНорме.Материал)
	|			И (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика = ВТИнфоПоНорме.Характеристика)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоИзделия КАК ВТКоличествоИзделия
	|		ПО (ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка = ВТКоличествоИзделия.ЭтапПроизводства2_2Ссылка)
	|ГДЕ
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства >= &ДатаНачала
	|	И ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства <= &ДатаОкончания
	|
	|СГРУППИРОВАТЬ ПО
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Характеристика,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.НомерСтроки,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КАНАТ_КомментарийКЗаказу,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ДатаПроизводства,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Спецификация,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.КоличествоУпаковок,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Номенклатура.Артикул,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.КоличествоУпаковокФакт,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Статус,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.Артикул,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеХарактеристика,
	|	ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.ПартияПроизводства.ОсновноеИзделиеНоменклатура.ЕдиницаИзмерения
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этап,
	|	Изделие,
	|	ОбеспечениеНомерСтроки";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);  
	
	Если ЗначениеЗаполнено(Подразделение) тогда
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Подразделение = &Подразделение)");
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
	КонецЕсли;
	Если ЗначениеЗаполнено(СтатусЭтапа) тогда
		СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор.Добавить("(ЭтапПроизводства2_2ОбеспечениеМатериаламиИРаботами.Ссылка.Статус В(&Статусы))");
		Запрос.УстановитьПараметр("Статусы", СтатусЭтапа);
	КонецЕсли;
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	Запрос.УстановитьПараметр("ДатаНачала", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Период.ДатаОкончания);
	
	

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаТЧ = ФактическийРасход.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьТекущимиДанными(Команда)
	ЗаполнитьТекущимиДаннымиНаСервере(); 
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура ОтразитьФактНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЗ.Статус КАК Статус,
	|	ТЗ.УдалитьСтроку КАК УдалитьСтроку,
	|	ТЗ.ИзменитьСтроку КАК ИзменитьСтроку,   
	|	ТЗ.Этап КАК Этап,
	|	ТЗ.Изделие КАК Изделие,
	|	ТЗ.КодИзделия КАК КодИзделия,
	|	ТЗ.ХарактеристикаИзделия КАК ХарактеристикаИзделия,
	|	ТЗ.ЕдиницаИзмеренияИзделия КАК ЕдиницаИзмеренияИзделия,
	|	ТЗ.КоличествоИзделия КАК КоличествоИзделия,
	|	ТЗ.Сырье КАК Сырье,
	|	ТЗ.ХарактеристикаСырья КАК ХарактеристикаСырья,
	|	ТЗ.КодСырья КАК КодСырья,
	//|	ТЗ.Отменено КАК Отменено,
	|	ТЗ.Нормарасхода КАК Нормарасхода,
	|	ТЗ.ФактРасхода КАК ФактРасхода,
	|	ТЗ.Спецификация КАК Спецификация,
	|	ТЗ.ДатаРасхода КАК ДатаРасхода,
	|	ТЗ.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ТЗ.ОбеспечениеНомерСтроки КАК ОбеспечениеНомерСтроки,
	|	ТЗ.ДатаПроизводства КАК ДатаПроизводства,
	|	ТЗ.КомментарийКЗаказу КАК КомментарийКЗаказу
	//|	ТЗ.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Статус КАК Статус,
	|	ВТ.УдалитьСтроку КАК УдалитьСтроку,
	|	ВТ.ИзменитьСтроку КАК ИзменитьСтроку, 
	|	ВТ.Этап КАК Этап,
	|	ВТ.Изделие КАК Изделие,
	|	ВТ.КодИзделия КАК КодИзделия,
	|	ВТ.ХарактеристикаИзделия КАК ХарактеристикаИзделия,
	|	ВТ.ЕдиницаИзмеренияИзделия КАК ЕдиницаИзмеренияИзделия,
	|	ВТ.КоличествоИзделия КАК КоличествоИзделия,
	|	ВТ.Сырье КАК Сырье,
	|	ВТ.ХарактеристикаСырья КАК ХарактеристикаСырья,
	|	ВТ.КодСырья КАК КодСырья,
	//|	ТЗ.Отменено КАК Отменено,
	|	ВТ.Нормарасхода КАК Нормарасхода,
	|	ВТ.ФактРасхода КАК ФактРасхода,
	|	ВТ.Спецификация КАК Спецификация,
	|	ВТ.ДатаРасхода КАК ДатаРасхода,
	|	ВТ.СтатьяКалькуляции КАК СтатьяКалькуляции,
	|	ВТ.ДатаПроизводства КАК ДатаПроизводства,
	|	ВТ.КомментарийКЗаказу КАК КомментарийКЗаказу,
	//|	ВТ.ИзделиеНомерСтроки КАК ИзделиеНомерСтроки,
	|	ВТ.ОбеспечениеНомерСтроки КАК ОбеспечениеНомерСтроки
	//|	ВТ.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	ВТ КАК ВТ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Этап,
	|	УдалитьСтроку
	|ИТОГИ ПО
	|	Этап";
	
	Запрос.УстановитьПараметр("ТЗ", ФактическийРасход.Выгрузить());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаЭтапы = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
	ПричинаОтменыСсылка = Справочники.ПричиныОтменыПроизводства.НайтиПоНаименованию("АРМ",Истина);
	Если ПричинаОтменыСсылка = Справочники.ПричиныОтменыПроизводства.ПустаяСсылка() Тогда
		ПричинаОбъект = Справочники.ПричиныОтменыПроизводства.СоздатьЭлемент();
		ПричинаОбъект.Наименование = "АРМ";
		ПричинаОбъект.Записать();
		ПричинаОтменыСсылка = ПричинаОбъект.Ссылка;
	КонецЕсли;
	
	Пока ВыборкаЭтапы.Следующий() Цикл
		ДокументЭтап = ВыборкаЭтапы.Этап.ПолучитьОбъект();
		ВыборкаДетальныеЗаписи = ВыборкаЭтапы.Выбрать();   
		//МассивСтрокИзделий = Новый Массив;
		//МассивСтрокРасхода = Новый Массив; 
		ТребуетсяЗапись = Ложь;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
			Если НЕ ВыборкаДетальныеЗаписи.УдалитьСтроку И НЕ ВыборкаДетальныеЗаписи.ИзменитьСтроку тогда
				Продолжить;
			КонецЕсли;
			ТребуетсяЗапись = Истина;
			//СтрокаТЧРасходМатериаловИРабот = ДокументЭтап.РасходМатериаловИРабот.Найти("НомерСтроки",ВыборкаДетальныеЗаписи.РасходНомерСтроки); 
			//Если СтрокаТЧВыходныеИздения = Неопределено и НЕ ВыборкаДетальныеЗаписи.УдалитьСтроку Тогда  
			ПараметрыЗаполненияНазначений = ОбеспечениеПроизводства.ПараметрыДействияЗаполнитьНазначениеОбеспеченияВЭтапеПроизводства(
				ДокументЭтап, ДокументЭтап.ВыходныеИзделия);

			Если ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки = 0 и НЕ ВыборкаДетальныеЗаписи.УдалитьСтроку Тогда  
				СтрокаТЧОбеспечениеМатериаламиИРаботами = ДокументЭтап.ОбеспечениеМатериаламиИРаботами.Добавить(); 
				ЗаполнитьЗначенияСвойств(СтрокаТЧОбеспечениеМатериаламиИРаботами,ДокументЭтап,,"Назначение");
				ЗаполнитьЗначенияСвойств(СтрокаТЧОбеспечениеМатериаламиИРаботами,ВыборкаДетальныеЗаписи); 
				
				СтрокаТЧОбеспечениеМатериаламиИРаботами.КоличествоУпаковок = ВыборкаДетальныеЗаписи.ФактРасхода;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Количество = ВыборкаДетальныеЗаписи.ФактРасхода;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Номенклатура = ВыборкаДетальныеЗаписи.Сырье;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Характеристика = ВыборкаДетальныеЗаписи.ХарактеристикаСырья;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции = ВыборкаДетальныеЗаписи.СтатьяКалькуляции; 
				СтрокаТЧОбеспечениеМатериаламиИРаботами.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;    
				СтрокаТЧОбеспечениеМатериаламиИРаботами.НазначениеОбеспечения = ПараметрыЗаполненияНазначений.НазначениеМатериалы;    
				//СтрокаТЧОбеспечениеМатериаламиИРаботами.Подразделение = ДокументЭтап.Подразделение;
				//СтрокаТЧОбеспечениеМатериаламиИРаботами.Спецификация =  ДокументЭтап.Спецификация;
				Цех = ПолучитьЦех(ДокументЭтап.Подразделение);  
				Если Цех <> Неопределено Тогда
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Склад = Цех;
				КонецЕсли;

				
	//СтрокаТЧОбеспечениеМатериаламиИРаботами.ДатаРасхода = ВыборкаДетальныеЗаписи.ДатаПроизводства;
				//МассивСтрокИзделий.Добавить(СтрокаТЧВыходныеИздения); 
				
				//Обеспечение                                                   
				//ОтборСтрок = Новый Структура;                                    
				//ОтборСтрок.Вставить("Номенклатура",ВыборкаДетальныеЗаписи.Сырье);
				//ОтборСтрок.Вставить("Характеристика",ВыборкаДетальныеЗаписи.ХарактеристикаСырья);
				//СтрокаРасхода = ДокументЭтап.РасходМатериаловИРабот.НайтиСтроки();
				//Если ЗначениеЗаполнено(СтрокаОбеспечения) тогда
				//	СтрокаОбеспечения.КоличествоУпаковок =  ВыборкаДетальныеЗаписи.ФактРасхода;  
				//Иначе
				//	СтрокаОбеспечения = ДокументЭтап.РасходМатериаловИРабот.Добавить();
				//	ЗаполнитьЗначенияСвойств(СтрокаОбеспечения, ДокументЭтап.ОбеспечениеМатериаламиИРаботами[0],"Склад,ВариантОбеспечения,ДатаОтгрузки,Спецификация,Назначение,НазначениеОбеспечения,Обособленно,Подразделение,Упаковка");
				//	СтрокаОбеспечения.КоличествоУпаковок = ВыборкаДетальныеЗаписи.ФактРасхода;
				//	СтрокаОбеспечения.Номенклатура = ВыборкаДетальныеЗаписи.Сырье;
				//	СтрокаОбеспечения.Характеристика = ВыборкаДетальныеЗаписи.ХарактеристикаСырья;
				//	СтрокаОбеспечения.СтатьяКалькуляции = ВыборкаДетальныеЗаписи.СтатьяКалькуляции; 
				//	СтрокаОбеспечения.ВариантОбеспечения = Перечисления.ВариантыОбеспечения.Отгрузить;
				//КонецЕсли;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки <> 0 И ВыборкаДетальныеЗаписи.УдалитьСтроку Тогда  
				СтрокаТЧОбеспечениеМатериаламиИРаботами = ДокументЭтап.ОбеспечениеМатериаламиИРаботами[ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки-1];
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Отменено = Истина;  
				СтрокаТЧОбеспечениеМатериаламиИРаботами.ПричинаОтмены = ПричинаОтменыСсылка;
				//ДокументЭтап.ОбеспечениеМатериаламиИРаботами.Удалить(ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки-1);
				//Обеспечение
				//СтрокаОбеспечения = ДокументЭтап.РасходМатериаловИРабот.Найти(ВыборкаДетальныеЗаписи.Сырье,"Номенклатура");
				//Если ЗначениеЗаполнено(СтрокаРасхода) тогда
				//	ДокументЭтап.РасходМатериаловИРабот.Удалить(СтрокаРасхода);
				//КонецЕсли;
				
			ИначеЕсли ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки <> 0 Тогда 
				СтрокаТЧОбеспечениеМатериаламиИРаботами = ДокументЭтап.ОбеспечениеМатериаламиИРаботами[ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки-1];
				СтрокаТЧОбеспечениеМатериаламиИРаботами.КоличествоУпаковок = ВыборкаДетальныеЗаписи.ФактРасхода;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Количество = ВыборкаДетальныеЗаписи.ФактРасхода;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Номенклатура = ВыборкаДетальныеЗаписи.Сырье;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Характеристика = ВыборкаДетальныеЗаписи.ХарактеристикаСырья;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.СтатьяКалькуляции = ВыборкаДетальныеЗаписи.СтатьяКалькуляции;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.Отменено = Ложь;
				СтрокаТЧОбеспечениеМатериаламиИРаботами.ПричинаОтмены = Неопределено;
				//Обеспечение
				//СтрокаРасхода = ДокументЭтап.РасходМатериаловИРабот.Найти(ВыборкаДетальныеЗаписи.Сырье,"Номенклатура");
				//Если ЗначениеЗаполнено(СтрокаРасхода) тогда
				//	СтрокаРасхода.КоличествоУпаковок =  ВыборкаДетальныеЗаписи.ФактРасхода;
				//КонецЕсли;
			Иначе
				ОбщегоНазначения.СообщитьПользователю("Попало в Иначе (удалить строку номер ноль). Ошибка со строками у "+ВыборкаЭтапы.Этап+" - стр."+ВыборкаДетальныеЗаписи.ОбеспечениеНомерСтроки);
			КонецЕсли;
			
		КонецЦикла;      
		
		//////////////////
		Если ТребуетсяЗапись Тогда  
			/////Заполню расход по данным обеспечения
			//ТаблицаИдендификаторов = ДокументЭтап.РасходМатериаловИРабот.ВыгрузитьКолонки("Номенклатура, Характеристика, ИдентификаторСтроки");
			//ДокументЭтап.РасходМатериаловИРабот.Очистить();
			//Для каждого СтрокаОбеспечения из ДокументЭтап.ОбеспечениеМатериаламиИРаботами Цикл
			//	Если СтрокаОбеспечения.Отменено Тогда
			//		Продолжить;
			//	КонецЕсли;
			//	ДобавляемаяСтрока = ДокументЭтап.РасходМатериаловИРабот.Добавить();
			//	ЗаполнитьЗначенияСвойств(ДобавляемаяСтрока,СтрокаОбеспечения,,"ИдентификаторСтроки"); 
			//	ДобавляемаяСтрока.ДатаРасхода = ДокументЭтап.ДатаПроизводства; 
			//	//ОтборСтрок = Новый Структура;                                    
			//	//ОтборСтрок.Вставить("Номенклатура",СтрокаОбеспечения.Номенклатура);
			//	//ОтборСтрок.Вставить("Характеристика",СтрокаОбеспечения.Характеристика);				
			//	//МассивПодходящих = ТаблицаИдендификаторов.НайтиСтроки(ОтборСтрок);
			//	//Если ТаблицаИдендификаторов.Количество() Тогда
			//	//	ДобавляемаяСтрока.ИдентификаторСтроки = МассивПодходящих[0].ИдентификаторСтроки;
			//	//	ТаблицаИдендификаторов.Удалить(МассивПодходящих[0]);                            
			//	
			Документы.ЭтапПроизводства2_2.ЗаполнитьРасходМатериаловИРаботПоДаннымОбеспечения(ДокументЭтап, 0); 
			//  Режим - Число - 0 => заполнение происходит только по данным обеспечения (расход предварительно очищается),
			//          1 => к расходу добавляются данные из обеспечения,
			//          2 => расход корректируется (синхронизируется) по данным обеспечения.
			//
			
			ДокументЭтап.Записать(РежимЗаписиДокумента.Проведение);
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Изменён %1",ВыборкаЭтапы.Этап)); 
		КонецЕсли;
	КонецЦикла;


КонецПроцедуры

&НаКлиенте
Процедура ОтразитьФакт(Команда)
	ОтразитьФактНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьПоСпецификацииНаСервере()
	

КонецПроцедуры

&НаКлиенте
Процедура ПерезаполнитьПоСпецификации(Команда)
		ПараметрыОткрытия = Новый Структура;
	
	
	ПараметрыОткрытия.Вставить("ГруппаФинУчета", ПолучитьГруппуФинУчета());	 
	ПараметрыОткрытия.Вставить("ЗакрыватьПослеВыбора", Истина);
	ОткрытьФорму("Справочник.РесурсныеСпецификации.ФормаВыбора",
	ПараметрыОткрытия,
	ЭтотОбъект,,,,,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	
	ПерезаполнитьПоСпецификацииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Функция ПолучитьЦех(ПодразделениеСсылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Подразделение = &Подразделение
	|	И Склады.ЦеховаяКладовая = ИСТИНА";
	
	Запрос.УстановитьПараметр("Подразделение", ПодразделениеСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;  
		
	Иначе 
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура УстановитьУсловноеОформление()
	УсловноеОформление.Элементы.Очистить();

	//Сначала задам поля которые редактировать нельзя всегда 
	//Отбор укажу через ИЛИ два условия, одно из которых всегда выполняется. так элемент оформления будет применяться всегда
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ИзменитьСтроку"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ИзменитьСтроку"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСтатус");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходИзделие");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКодИзделия");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходХарактеристика");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходУпаковкиЕдиницыИзмерения");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКоличество");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКодСырья");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходНормаРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСпецификация");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДатаПроизводства");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКомментарийКЗаказу");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДобавленнаяСтрока");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСтатьяКалькуляции");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДатаРасхода");	
	////////////////////////
	
	//У Основного сырья нельзя ставить удаление
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ОсновноеСырье"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина;   	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходУдалитьСтроку");	

	//Если поставили признак менять строку, то можно менять количество
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина); 
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ИзменитьСтроку"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;   	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходФактРасхода");	

	
	//Если поставили менять строку у вспомогательного сырья, то можно менять ещё и само сырьё
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);  
	ГруппаОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
	ГруппаОтбора.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли;
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ИзменитьСтроку"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Ложь;  
	ЭлементОтбора = ГруппаОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ОсновноеСырье"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСырье");	
	
	
	//Выделаем цветом отменённые строки серым (которые уже были заранее отменены)
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветТекстаНевыбраннойКартинки);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.Отменено"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
	ЭлементОтбора.ПравоеЗначение = Истина; 
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходНормаРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходФактРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСтатус");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходИзделие");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКодИзделия");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходХарактеристика");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходУпаковкиЕдиницыИзмерения");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКоличество");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКодСырья");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходНормаРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСпецификация");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДатаПроизводства");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходКомментарийКЗаказу");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДобавленнаяСтрока");	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСтатьяКалькуляции");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходДатаРасхода");
		ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходСырье");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходЭтап");
		////////////////////////

	//Выделаем цветом расхождения с нормой
	ЭлементОформления = УсловноеОформление.Элементы.Добавить(); 
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.СтатусОбработкиОшибкаПередачиГосИС);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ФактическийРасходНормаРасхода"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно; 
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("ФактическийРасход.ФактическийРасходФактРасхода"); 
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходНормаРасхода");
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ФактическийРасходФактРасхода");
		////////////////////////

КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходИзменитьСтрокуПриИзменении(Элемент)  
	ВключилиИзменение = Элементы.ФактическийРасход.ТекущиеДанные.ИзменитьСтроку;
	
	Если ВключилиИзменение Тогда 
		Элементы.ФактическийРасход.ТекущиеДанные.УдалитьСтроку = Ложь;
		//Элементы.ФактическийРасход.ТекущийЭлемент = Элементы.ФактическийРасход.ФактРасхода;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходУдалитьСтрокуПриИзменении(Элемент) 
	УдаляютСтроку = Элементы.ФактическийРасход.ТекущиеДанные.УдалитьСтроку;
	
	Если УдаляютСтроку Тогда 
		Элементы.ФактическийРасход.ТекущиеДанные.ИзменитьСтроку = Ложь;                
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходПриИзменении(Элемент)
	
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если Копирование Тогда
		Элементы.ФактическийРасход.ТекущиеДанные.УдалитьСтроку = Ложь;
		Элементы.ФактическийРасход.ТекущиеДанные.ИзменитьСтроку = Истина;
	КонецЕсли;
	
	Если НоваяСтрока Тогда
		Элементы.ФактическийРасход.ТекущиеДанные.ОбеспечениеНомерСтроки = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходСырьеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;        
	
	ПараметрыОткрытия = Новый Структура;
	
	
	ПараметрыОткрытия.Вставить("ГруппаФинУчета", ПолучитьГруппуФинУчета());
	ПараметрыОткрытия.Вставить("Склад", ПолучитьЦех(ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.ФактическийРасход.ТекущиеДанные.Этап,"Подразделение")));
	ПараметрыОткрытия.Вставить("ЗакрыватьПослеВыбора", Истина);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.КАНАТ_ФормаВыбораВспомогательногоСырья",
	ПараметрыОткрытия,
	Элемент,,,,,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры     

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) 

	//Если ИсточникВыбора.ИмяФормы = "Справочник.Номенклатура.Форма.КАНАТ_ФормаВыбораВспомогательногоСырья" 
	//	И ЗначениеЗаполнено(ВыбранноеЗначение) 
	//	И ИсточникВыбора.ОписаниеОповещенияОЗакрытии = Неопределено Тогда
	//	Элементы.ФактическийРасход.ТекущиеДанные.Сырье = ВыбранноеЗначение;	
	//    Элементы.ФактическийРасход.ТекущиеДанные.КодСырья = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Артикул");
	//	Элементы.ФактическийРасход.ТекущиеДанные.НормаРасхода = 0; 
	//Иначе
	Если ИсточникВыбора.ИмяФормы = "Справочник.РесурсныеСпецификации.Форма.ФормаВыбора" И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		СтруктураДанныхПоСпецификации = ПолучитьДанныеПоСпецификации(ВыбранноеЗначение);
		
		Элементы.ФактическийРасход.ТекущиеДанные.УдалитьСтроку = Ложь;
		Элементы.ФактическийРасход.ТекущиеДанные.ИзменитьСтроку = Истина;
		Элементы.ФактическийРасход.ТекущиеДанные.Спецификация = ВыбранноеЗначение;
		ЗаполнитьЗначенияСвойств(Элементы.ФактическийРасход.ТекущиеДанные,СтруктураДанныхПоСпецификации);
		//Элементы.ФактическийРасход.ТекущиеДанные.Сырье = 
	КонецЕсли;
	
КонецПроцедуры    


&НаСервере
Функция ПолучитьДанныеПоСпецификации(СсылкаСпецификация)
	
	Структура = Новый Структура;  
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура КАК Номенклатура,
		|	РесурсныеСпецификацииМатериалыИУслуги.Номенклатура.Артикул КАК КодСырья
		|ИЗ
		|	Справочник.РесурсныеСпецификации.МатериалыИУслуги КАК РесурсныеСпецификацииМатериалыИУслуги
		| Где РесурсныеСпецификацииМатериалыИУслуги.Ссылка = &СсылкаСпецификация";
	Запрос.УстановитьПараметр("СсылкаСпецификация",СсылкаСпецификация);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	Структура.Вставить("Сырье",ВыборкаДетальныеЗаписи.Номенклатура);
	Структура.Вставить("КодСырья",ВыборкаДетальныеЗаписи.КодСырья);
	КонецЕсли;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьГруппуФинУчета()             
	
	//УстановитьПривилегированныйРежим(Истина);	
	//Возврат Константы.КАНАТ_ГруппаФинУчетаВспомогательноеСырье.Получить();
	//УстановитьПривилегированныйРежим(Ложь);	

		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыФинансовогоУчетаНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ГруппыФинансовогоУчетаНоменклатуры КАК ГруппыФинансовогоУчетаНоменклатуры
		|ГДЕ
		|	ГруппыФинансовогоУчетаНоменклатуры.КАНАТ_ГруппаФинансовогоУчетаВспомогательногоСырья = ИСТИНА";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	
КонецФункции

&НаКлиенте
Процедура ДобавитьКЭтапу(Команда)   
    описаниеОповещения = Новый ОписаниеОповещения("ДобавитьКЭтапуЗавершение",ЭтотОбъект);
	
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ГруппаФинУчета", ПолучитьГруппуФинУчета());
	ПараметрыОткрытия.Вставить("Склад", ПолучитьЦех(ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(Элементы.ФактическийРасход.ТекущиеДанные.Этап,"Подразделение")));
	ПараметрыОткрытия.Вставить("ЗакрыватьПослеВыбора", Истина);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.КАНАТ_ФормаВыбораВспомогательногоСырья",
	ПараметрыОткрытия,
	ЭтотОбъект,,,,ОписаниеОповещения,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
       
КонецПроцедуры    

&НаСервере
Функция ПолучитьСтатьюКалькуляции()             
		
УстановитьПривилегированныйРежим(Истина);
Возврат Константы.КАНАТ_СтатьяКалькуляцииВспомогательноеСырье.Получить();
	
КонецФункции


&НаКлиенте
Процедура ДобавитьКЭтапуЗавершение(РезультатЗакрытия,ДополнительныеПараметры)   Экспорт
	
	Если ЗначениеЗаполнено(РезультатЗакрытия) Тогда  
		//Индекс = Элементы.ФактическийРасход.ТекущаяСтрока; 
		НоваяСтрока = ФактическийРасход.Добавить();    
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Элементы.ФактическийРасход.ТекущиеДанные,
		"ДатаПроизводства,	
		| ЕдиницаИзмеренияИзделия,	
		| Изделие,	
		| КодИзделия,	
		| КоличествоИзделия,	
		| КомментарийКЗаказу,	
		| Статус,	
		| ХарактеристикаИзделия,	
		| Этап,
		| СтатьяКалькуляции,
		| ДатаРасхода,
		|Спецификация");
		
		НоваяСтрока.Сырье = РезультатЗакрытия;
		НоваяСтрока.КодСырья = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(РезультатЗакрытия, "Артикул");    
		НоваяСтрока.СтатьяКалькуляции = ПолучитьСтатьюКалькуляции();
		НоваяСтрока.ИзменитьСтроку = Истина; 
		//ЭтаФорма.ТекущийЭлемент = Элементы.ФактическийРасход[Индекс].ФактРасхода;
		
	КонецЕсли;
	
КонецПроцедуры 	

&НаКлиенте
Процедура ФактическийРасходПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЭтап(Команда)
ОткрытьФорму("Документ.ЭтапПроизводства2_2.Форма.ФормаДокумента",Новый Структура("Ключ",Элементы.ФактическийРасход.ТекущиеДанные.Этап));

КонецПроцедуры

&НаКлиенте
Процедура ФактическийРасходСырьеОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура")
		И ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		СтрокаТабличнойЧасти = Элементы.ФактическийРасход.ТекущиеДанные;
		СтрокаТабличнойЧасти.Сырье = ВыбранноеЗначение;	
		СтрокаТабличнойЧасти.КодСырья = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ВыбранноеЗначение, "Артикул");
		СтрокаТабличнойЧасти.НормаРасхода = 0;         
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ФактическийРасходПриАктивизацииСтроки(Элемент)   
	Если ФактическийРасход.Количество()>0 И Элементы.ФактическийРасход.ТекущиеДанные <> Неопределено Тогда
	Элементы.ФактическийРасходКонтекстноеМенюСкопировать.Доступность = НЕ Элементы.ФактическийРасход.ТекущиеДанные.ОсновноеСырье;
	КонецЕсли;
КонецПроцедуры
